Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
menu.CDCOnBoot=USB CDC On Boot
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

heltec_wifi_kit_32.name=WiFi Kit 32

heltec_wifi_kit_32.bootloader.tool=esptool_py
heltec_wifi_kit_32.bootloader.tool.default=esptool_py

heltec_wifi_kit_32.upload.tool=esptool_py
heltec_wifi_kit_32.upload.tool.default=esptool_py
heltec_wifi_kit_32.upload.tool.network=esp_ota

heltec_wifi_kit_32.upload.maximum_size=1310720
heltec_wifi_kit_32.upload.maximum_data_size=327680
heltec_wifi_kit_32.upload.flags=
heltec_wifi_kit_32.upload.extra_flags=

heltec_wifi_kit_32.serial.disableDTR=true
heltec_wifi_kit_32.serial.disableRTS=true

heltec_wifi_kit_32.build.tarch=xtensa
heltec_wifi_kit_32.build.bootloader_addr=0x1000
heltec_wifi_kit_32.build.target=esp32
heltec_wifi_kit_32.build.mcu=esp32
heltec_wifi_kit_32.build.core=esp32
heltec_wifi_kit_32.build.variant=heltec_wifi_kit_32
heltec_wifi_kit_32.build.board=HELTEC_WIFI_KIT_32

heltec_wifi_kit_32.build.f_cpu=240000000L
heltec_wifi_kit_32.build.flash_size=4MB
heltec_wifi_kit_32.build.flash_freq=80m
heltec_wifi_kit_32.build.flash_mode=dio
heltec_wifi_kit_32.build.boot=dio
heltec_wifi_kit_32.build.partitions=default
heltec_wifi_kit_32.build.defines=
heltec_wifi_kit_32.build.band=LoRaWAN_NONE
heltec_wifi_kit_32.build.LoRaWanDebugLevel=0

heltec_wifi_kit_32.menu.PSRAM.disabled=Disabled
heltec_wifi_kit_32.menu.PSRAM.disabled.build.defines=
heltec_wifi_kit_32.menu.PSRAM.disabled.build.extra_libs=
heltec_wifi_kit_32.menu.PSRAM.enabled=Enabled
heltec_wifi_kit_32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
heltec_wifi_kit_32.menu.PSRAM.enabled.build.extra_libs=

heltec_wifi_kit_32.menu.CPUFreq.240=240MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_kit_32.menu.CPUFreq.160=160MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_kit_32.menu.CPUFreq.80=80MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.80.build.f_cpu=80000000L

heltec_wifi_kit_32.menu.UploadSpeed.921600=921600
heltec_wifi_kit_32.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_kit_32.menu.UploadSpeed.115200=115200
heltec_wifi_kit_32.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_kit_32.menu.UploadSpeed.256000.windows=256000
heltec_wifi_kit_32.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400=230400
heltec_wifi_kit_32.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_kit_32.menu.UploadSpeed.460800.linux=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_kit_32.menu.UploadSpeed.512000.windows=512000
heltec_wifi_kit_32.menu.UploadSpeed.512000.upload.speed=512000

heltec_wifi_kit_32.menu.DebugLevel.none=None
heltec_wifi_kit_32.menu.DebugLevel.none.build.code_debug=0
heltec_wifi_kit_32.menu.DebugLevel.error=Error
heltec_wifi_kit_32.menu.DebugLevel.error.build.code_debug=1
heltec_wifi_kit_32.menu.DebugLevel.warn=Warn
heltec_wifi_kit_32.menu.DebugLevel.warn.build.code_debug=2
heltec_wifi_kit_32.menu.DebugLevel.info=Info
heltec_wifi_kit_32.menu.DebugLevel.info.build.code_debug=3
heltec_wifi_kit_32.menu.DebugLevel.debug=Debug
heltec_wifi_kit_32.menu.DebugLevel.debug.build.code_debug=4
heltec_wifi_kit_32.menu.DebugLevel.verbose=Verbose
heltec_wifi_kit_32.menu.DebugLevel.verbose.build.code_debug=5

heltec_wifi_kit_32.menu.EraseFlash.none=Disabled
heltec_wifi_kit_32.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_kit_32.menu.EraseFlash.all=Enabled
heltec_wifi_kit_32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wifi_kit_32_V3.name=WiFi Kit 32(V3)

heltec_wifi_kit_32_V3.vid.0=0x303a
heltec_wifi_kit_32_V3.pid.0=0x1001

heltec_wifi_kit_32_V3.bootloader.tool=esptool_py
heltec_wifi_kit_32_V3.bootloader.tool.default=esptool_py

heltec_wifi_kit_32_V3.upload.tool=esptool_py
heltec_wifi_kit_32_V3.upload.tool.default=esptool_py
heltec_wifi_kit_32_V3.upload.tool.network=esp_ota

heltec_wifi_kit_32_V3.upload.maximum_size=3342336
heltec_wifi_kit_32_V3.upload.maximum_data_size=327680
heltec_wifi_kit_32_V3.upload.flags=
heltec_wifi_kit_32_V3.upload.extra_flags=
heltec_wifi_kit_32_V3.upload.use_1200bps_touch=false
heltec_wifi_kit_32_V3.upload.wait_for_upload_port=false

heltec_wifi_kit_32_V3.serial.disableDTR=false
heltec_wifi_kit_32_V3.serial.disableRTS=false

heltec_wifi_kit_32_V3.build.tarch=xtensa
heltec_wifi_kit_32_V3.build.bootloader_addr=0x0
heltec_wifi_kit_32_V3.build.target=esp32s3
heltec_wifi_kit_32_V3.build.mcu=esp32s3
heltec_wifi_kit_32_V3.build.core=esp32
heltec_wifi_kit_32_V3.build.variant=heltec_wifi_kit_32_V3
heltec_wifi_kit_32_V3.build.board=HELTEC_WIFI_KIT_32_V3

heltec_wifi_kit_32_V3.build.usb_mode=1
heltec_wifi_kit_32_V3.build.cdc_on_boot=0
heltec_wifi_kit_32_V3.build.msc_on_boot=0
heltec_wifi_kit_32_V3.build.dfu_on_boot=0
heltec_wifi_kit_32_V3.build.f_cpu=240000000L
heltec_wifi_kit_32_V3.build.flash_size=8MB
heltec_wifi_kit_32_V3.build.flash_freq=80m
heltec_wifi_kit_32_V3.build.flash_mode=dio
heltec_wifi_kit_32_V3.build.boot=qio
heltec_wifi_kit_32_V3.build.boot_freq=80m
heltec_wifi_kit_32_V3.build.partitions=default_8MB
heltec_wifi_kit_32_V3.build.loop_core=
heltec_wifi_kit_32_V3.build.event_core=
heltec_wifi_kit_32_V3.build.psram_type=qspi
heltec_wifi_kit_32_V3.build.memory_type={build.boot}_{build.psram_type}

heltec_wifi_kit_32_V3.menu.LoopCore.1=Core 1
heltec_wifi_kit_32_V3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_wifi_kit_32_V3.menu.LoopCore.0=Core 0
heltec_wifi_kit_32_V3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_wifi_kit_32_V3.menu.EventsCore.1=Core 1
heltec_wifi_kit_32_V3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wifi_kit_32_V3.menu.EventsCore.0=Core 0
heltec_wifi_kit_32_V3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wifi_kit_32_V3.menu.CPUFreq.240=240MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.160=160MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.80=80MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.40=40MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.20=20MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.10=10MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.10.build.f_cpu=10000000L

